# BeamSystemTagBadView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BeamSystemFailures..::..BeamSystemTagBadView Property
BuiltInFailures..::..BeamSystemFailures Class See Also
---
Beam System Tags can only be placed in plan , elevation and 3D views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BeamSystemTagBadView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BeamSystemTagBadView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BeamSystemTagBadView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..BeamSystemFailures Class
Autodesk.Revit.DB Namespace